// 1. Створіть змінну, що симулює вибір варіанта зі списку. 
//    Виводьте повідомлення залежно від обраного варіанта: 
//    "Кава", "Чай" або "Сік". Використайте switch
var choice = "Чай";

switch (choice) {
    case "кава":
        console.log("Кава");
        break
    case "Чай":
        console.log("Чай");
        break
    case "Сік":
        console.log("Сік");
}
console.log("~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~")

// 2. Створіть змінну для зберігання введеного рядка, який 
//    може бути днем тижня. Якщо це робочий день — виведіть 
//    повідомлення про робочий день, якщо вихідний — про вихідний.
var day = "неділя";

switch (day) {
    case "понеділок":
    case "вівторок":
    case "середа":
    case "четвер":
    case "п'ятниця":
        console.log("Це робочий день");
        break;

    case "субота":
    case "неділя":
        console.log("Це вихідний");
        break;
}
console.log("~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~")

// 3. Створіть змінну для зберігання номера місяця. За номером 
//    місяця визначайте пору року і виводьте відповідне 
//    повідомлення.
var month = 6;

switch (month) {
    case 12:
    case 1:
    case 2:
        console.log("зимааа");
        break
    case 3:
    case 4:
    case 5:
        console.log("весна");
        break
    case 6:
    case 7:
    case 8:
        console.log("літо");
        break
    case 9:
    case 10:
    case 11:
        console.log("осінь");
}
console.log("~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~")

// 4. Створіть змінну для зберігання назви кольору. Виводьте 
//    повідомлення відповідно до вибраного кольору: якщо 
//    "червоний" — "стоп", "зелений" — "йти", "жовтий" — "чекати".
var color = "червоний";

switch (color) {
    case "червоний":
        console.log("стоп");
        break;
    case "зелений":
        console.log("йти");
        break;
    case "жовтий":
        console.log("чекати");
}
console.log("~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~")

// 5. Створіть змінні для зберігання двох чисел та оператора 
//    (як у списку select). Виконайте відповідну операцію та 
//    виведіть результат. У випадку ділення на нуль — виведіть 
//    попередження.
var num1 = 37;
var num2 = 0;
var operator = "/";

switch (operator) {
    case "+":
        console.log(num1 + num2);
        break;
    case "-":
        console.log(num1 - num2);
        break;
    case "*":
        console.log(num1 * num2);
        break;
    case "/":
        if (num2 === 0) {
            console.log("ти в школі вчився??");
        } else {
            console.log(num1 / num2);
        }
}